---
kind: method
id: M:Autodesk.Revit.DB.ViewOrientation3D.Dispose
source: html/541868b2-2814-0527-0ffa-d3f5a4522be3.htm
---
# Autodesk.Revit.DB.ViewOrientation3D.Dispose Method

Releases all resources used by the ViewOrientation3D

## Syntax (C#)
```csharp
public void Dispose()
```